tests/IsolatedBuildingCFDTest/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (12.3500 0 0);

boundaryField
{
    inlet
    {
	 //type 	 fixedValue;
	 //value 	 uniform (12.3500 0 0);

       	type            timeVaryingMappedFixedValue;
        value           $internalField;
    }

    outlet
    {
	 type 	 pressureInletOutletVelocity;
	 value 	 uniform (12.3500 0 0);
    }

    ground 
    {
	 type 	 uniformFixedValue;
	 value 	 uniform (0 0 0);
	 uniformValue 	 constant (0 0 0);
    }
    
    top    
    {
	 type    symmetry;
    }

    front    
    {
	 type 	 symmetry;
    }
    
    back    
    {
	 type    symmetry;
    }
    
    building 
    {
	 type 	 noSlip;
    }
}

// ************************************************************************* //
