tests/IsolatedBuildingCFDTest/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0100;

boundaryField
{
    inlet
    {
	 type 	 atmBoundaryLayerInletEpsilon;
	 Uref 	 12.3500;
	 Zref 	 0.4572;
	 zDir 	 (0.0 0.0 1.0);
	 flowDir 	 (1.0 0.0 0.0);
	 z0 	  uniform 0.0001;
	 zGround 	 uniform 0.0;
    }

    outlet
    {
	 type 	 inletOutlet;
	 inletValue 	 uniform 0.0100;
	 value 	 uniform 0.0100;
    }

    ground 
    {
	 type 	 zeroGradient;
    }
    
    top    
    {
	 type  	  symmetry;
    }

    front    
    {
	 type  	 symmetry;
    }
    
    back    
    {
	 type 	 symmetry;
    }
    
    building 
    {
	 type 	 zeroGradient;
    }
}

// ************************************************************************* //
