tests/IsolatedBuildingCFDTest/constant/simCenter/output/Uh.txt
1.104214e+01 -1.796996e-01 -1.192301e+00
1.113390e+01 -1.997312e-01 -1.176080e+00
1.130624e+01 1.425347e-02 -8.630824e-01
1.168916e+01 4.489363e-01 -4.951698e-01
1.234544e+01 8.920122e-01 -9.834164e-01
1.304146e+01 6.437559e-01 -1.469852e+00
1.278050e+01 9.729189e-01 -1.193134e+00
1.271358e+01 3.157619e-01 -1.137999e+00
1.223223e+01 7.282591e-01 -1.422397e+00
1.270012e+01 5.037810e-01 -1.746736e+00
1.298651e+01 9.867847e-01 -1.151010e+00
1.265587e+01 9.804822e-01 -1.255188e+00
1.263599e+01 7.341319e-01 -1.224103e+00
1.230121e+01 1.493769e+00 -1.157918e+00
1.268984e+01 1.412149e+00 -1.094898e+00
1.278230e+01 1.458260e+00 -9.281725e-01
1.233860e+01 1.656237e+00 -1.249001e+00
1.184307e+01 1.437331e+00 -7.643571e-01
1.122431e+01 3.203162e-01 -1.050861e+00
1.065321e+01 3.341107e-01 -7.562108e-01
1.035255e+01 1.490630e-01 -4.180954e-01
1.125847e+01 3.168912e-01 -6.188914e-01
1.095792e+01 2.035943e-01 -7.800688e-01
1.025812e+01 3.372114e-01 -7.178607e-01
1.004918e+01 3.024679e-01 -6.965655e-01
9.876734e+00 4.484282e-01 -4.121804e-01
1.028265e+01 6.219585e-01 -2.128608e-01
1.064211e+01 2.710452e-01 5.055907e-01
1.078189e+01 1.207410e-03 5.607257e-01
1.127549e+01 -5.673134e-01 7.663908e-01
1.100269e+01 -1.042725e+00 1.039526e+00
1.090606e+01 -1.778149e-01 7.781112e-01
1.159461e+01 -1.903562e-01 7.843688e-01
1.180189e+01 1.580355e-01 3.170900e-01
1.172206e+01 4.639664e-01 -2.839108e-01
1.162741e+01 1.729076e-01 5.563710e-01
1.209095e+01 4.765733e-01 7.817213e-01
1.241810e+01 6.208041e-01 5.864317e-01
1.211005e+01 2.575656e-01 1.344031e+00
1.293305e+01 7.548541e-01 1.363501e+00
1.274060e+01 6.375079e-01 1.618583e+00
1.276497e+01 4.608144e-01 1.343303e+00
1.258246e+01 -9.125269e-02 1.395836e+00
1.180321e+01 -2.590433e-01 8.251982e-01
1.147748e+01 -7.292169e-01 5.216791e-01
1.164221e+01 -6.201704e-01 4.864355e-01
1.157978e+01 -6.519207e-01 3.691918e-01
1.072614e+01 -1.195527e+00 2.805407e-01
1.007934e+01 -1.241663e+00 5.343438e-01
1.020765e+01 -9.411281e-01 5.199432e-01
1.026744e+01 -5.593859e-03 2.175304e-01
1.080003e+01 -4.303004e-01 5.257529e-01
1.119132e+01 -1.355455e-01 3.200540e-01
1.013909e+01 1.304155e-01 1.041792e+00
1.015372e+01 3.778435e-02 1.204442e+00
1.042885e+01 -2.388529e-01 2.602443e-01
1.048118e+01 5.087263e-01 5.117425e-01
1.076539e+01 5.348142e-01 -1.300993e-01
1.028455e+01 4.294430e-01 5.747454e-01
9.989753e+00 -1.769978e-01 9.934500e-01
9.930734e+00 -1.639658e-01 1.445593e+00
9.811293e+00 5.355316e-01 1.582442e+00
1.007462e+01 -2.683557e-02 1.724569e+00
1.028906e+01 -6.426165e-01 1.379137e+00
1.083002e+01 -1.826604e-01 1.606920e+00
1.061670e+01 -1.069113e+00 1.690635e+00
1.100976e+01 -1.493271e+00 1.480151e+00
1.098561e+01 -8.747880e-01 1.354686e+00
1.061551e+01 -9.791030e-01 1.207766e+00
1.037075e+01 -1.408037e+00 1.300717e+00
1.062379e+01 -1.097315e+00 1.535826e+00
1.043529e+01 -9.906931e-01 1.509840e+00
1.073587e+01 -6.616454e-01 1.562919e+00
1.093662e+01 -7.865564e-01 2.089308e+00
1.104214e+01 -1.404979e-01 2.422753e+00
1.095172e+01 -3.765546e-01 2.018627e+00
1.112361e+01 -3.441633e-01 2.282330e+00
1.194396e+01 -8.140817e-01 2.217793e+00
1.186957e+01 -1.822961e+00 2.041458e+00
1.161219e+01 -1.356209e+00 1.855137e+00
1.183444e+01 -7.138980e-01 1.749810e+00
1.184180e+01 -1.685451e-01 1.741072e+00
1.169220e+01 -5.049461e-01 1.362893e+00
1.141275e+01 -8.355458e-01 1.360470e+00
1.212347e+01 -1.377202e+00 1.252624e+00
1.221419e+01 -9.253732e-01 9.605298e-01
1.248715e+01 8.706475e-03 9.354803e-01
1.312426e+01 4.140574e-01 1.111673e+00
1.256554e+01 6.708559e-01 6.089658e-01
1.278749e+01 -1.394744e-01 5.646068e-01
1.271980e+01 -6.560486e-01 3.590533e-01
1.246549e+01 -9.827848e-01 -1.289567e-01
1.196332e+01 -1.152424e+00 4.634449e-01
1.167553e+01 -5.072004e-01 6.838781e-01
1.173800e+01 -3.473751e-01 2.511791e-01
1.253335e+01 -2.410698e-01 7.021683e-01
1.283054e+01 3.767134e-01 7.894018e-01
1.296161e+01 7.421711e-01 9.260585e-01
1.253667e+01 5.872681e-01 8.042347e-01
1.285604e+01 8.311312e-01 1.119050e+00
...
1.286776e+01 1.134205e+00 4.036546e-01
